# ExternalServiceOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServiceOptions Constructor
ExternalServiceOptions Class See Also
---
Constructs a new ExternalServiceOptions with default settings.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExternalServiceOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExternalServiceOptions()
```

# See Also
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace